{
	"VERSION": "Версія програми 1.1.4",
	"copy": "Скопійовано!",
	"empty": "у вас поки немає даних",

	"error": "Помилка",
	"key_message": "Невідома помилка з ключем доступу, переконайтеся, що ви ввели коректний ключ або зверніться до розробника.",
	"key_error": "Ключ обов'язковий!",
	"attention": "Увага!",
	"sign_out": "Вийти з облікового запису?",
	"data_will_be_deleted": "Дані будуть безповоротно видалені!",
	"name_error_min": "Ім'я має складатися щонайменше з 3-х символів!",
	"name_error_max": "Ім'я не повинне перевищувати 30 символів!",
	"pssword_error_repeat": "Паролі не співпадають!",
	"recovery": "Скинути пароль",
	"register_btn": "Зареєструватись",
	"auth_btn": "Авторизуватися",

	"forgot_password_btn": "Забув пароль",
	"login_input_register": "логін (існуюча пошта)",
	"login_input": "логін",
	"name_placeholder": "ім'я",
	"password_placeholder": "пароль",
	"key_placeholder": "ключ",
	"repeat_password": "повторний пароль",
	"title_placeholder": "Заголовок",
	"description_placeholder": "Опис *",
	"optional": "* - необов'язковий",
	"data_will_be_encrypted": "Ваші дані будуть зашифровані",

	"form_text_email": "Вам прийде лист із інструкцією на пошту, яку ви вказали. Дотримуйтесь інструкцій у листі.",
	"feedback": "залишити відгук",
	"share": "поділитися",
	"logout_btn": "вийти",
	"back": "назад",
	"delete_account": "видалити акаунт",
	"developer_site": "сайт розробника",
	"developer_contacts": "контакти розробника:",
	"about_application": "про додаток:",
	"privacy": "політика конфіденційності",
	"in_developing": "В розробці...",
	"change_code": "змінити код для входу до програми",
	"set_code": "встановити код для входу до програми",
	"change_language": "змінити мову",

	"slide_1": "Ласкаво просимо до Passwords manager",
	"slide_2": "Ваші дані зашифровані і ніхто, крім вас, не має доступу до них",
	"slide_3": "Бажаєте встановити пароль для входу до програми? У будь-який момент ви можете змінити його в налаштуваннях",
	"create": "створити",
	"camera": "Наведіть камеру на QR код",
	"screenshot": "Зробіть знімок екрана або збережіть ключ.",
	"without_key": "Без ключа ви не зможете відновити доступ до ваших даних!",
	"saved": "Я зберіг!",
	"pick_password": "придумайте пароль",
	"confirm_password": "повторіть пароль",
	"cancel": "скасувати",
	"data_protected": "Ваші дані захищені",
	"skip": "пропустити",
	"next": "наступний",
	"email_recovery_password": "На пошту {{email}} надіслано листа з інструкцією для скидання пароля.",

	"admin-restricted-operation": "Ця операція доступна лише адміністраторам.",
	"argument-error": "",
	"app-not-authorized": "Ця програма, що визначається доменом, на якому вона розміщена, не має права використовувати автентифікацію Firebase з наданим ключем API. Перевірте конфігурацію ключа в консолі Google API.",
	"app-not-installed": "Запитувана мобільна програма, що відповідає наданому ідентифікатору (назва пакета Android або ідентифікатор пакету iOS), не встановлена на цьому пристрої.",
	"captcha-check-failed": "Наданий токен відповіді reCAPTCHA є або недійсним, або простроченим, або вже використаним, або домен, пов'язаний з ним, не відповідає списку доменів із білого списку.",
	"code-expired": "Термін дії SMS-коду минув. Будь ласка, повторно надішліть код підтвердження, щоб повторити спробу.",
	"cordova-not-ready": "Фреймворк Cordova не готовий.",
	"cors-unsupported": "Цей браузер не підтримується.",
	"credential-already-in-use": "Ці облікові дані вже пов'язані з іншим обліковим записом користувача.",
	"custom-token-mismatch": "Токен користувача відповідає іншій аудиторії.",
	"requires-recent-login": "Ця операція є конфіденційною і вимагає нещодавньої автентифікації. Вийдіть і увійдіть в обліковий запис ще раз, перш ніж повторити цей запит.",
	"dynamic-link-not-activated": "Активуйте динамічні посилання в консолі Firebase і прийміть умови.",
	"email-change-needs-verification": "Багатофакторні користувачі завжди повинні мати підтверджену адресу електронної пошти.",
	"email-already-in-use": "Адреса електронної пошти вже використовується іншим обліковим записом.",
	"expired-action-code": "Термін дії коду дії минув.",
	"cancelled-popup-request": "Ця операція була скасована через відкриття іншого конфліктуючого спливаючого вікна.",
	"internal-error": "Відбулася внутрішня помилка.",
	"invalid-app-credential": "Запит на перевірку телефону містить неприпустимий верифікатор програми. Відповідь токена reCAPTCHA або недійсна, або прострочена.",
	"invalid-app-id": "Ідентифікатор мобільного додатку не зареєстрований для поточного проекту.",
	"invalid-user-token": "Облікові дані цього користувача є недійсними для цього проекту. Це може статися, якщо токен користувача був підроблений або якщо користувач не бере участі в проекті, пов'язаному з цим ключем API.",
	"invalid-auth-event": "Відбулася внутрішня помилка.",
	"invalid-verification-code": "Код підтвердження SMS, використаний для створення облікових даних для аутентифікації телефону, недійсний. Будь ласка, повторно надішліть смс із кодом підтвердження та обов'язково використовуйте код підтвердження, наданий користувачем.",
	"invalid-continue-uri": "URL-адреса продовження, зазначена у запиті, недійсна.",
	"invalid-cordova-configuration": "Наступні плагіни Cordova повинні бути встановлені для включення входу OAuth: cordova-plugin-buildinfo, cordova-universal-links-plugin, cordova-plugin-browsertab, cordova-plugin-inappbrowser та cordova-plugin customurlscheme.",
	"invalid-custom-token": "Неправильний формат токена користувача. Будь ласка, перевірте документацію.",
	"invalid-dynamic-link-domain": "Наданий домен динамічного посилання не налаштований або не авторизований для поточного проекту..",
	"invalid-email": "Адреса електронної пошти має неправильний формат.",
	"invalid-api-key": "Ваш API-ключ недійсний, перевірте, чи правильно ви його скопіювали.",
	"invalid-cert-hash": "Наданий хеш сертифіката SHA-1 недійсний.",
	"invalid-credential": "Надані облікові дані для автентифікації мають неправильний формат або термін їх дії минув.",
	"invalid-message-payload": "Шаблон електронної пошти, що відповідає цій дії, містить неприпустимі символи у своєму повідомленні. Будь ласка, виправте, перейшовши до розділу шаблонів електронної пошти Auth у консолі Firebase.",
	"invalid-multi-factor-session": "Запит не містить дійсного доказу успішного входу з використанням першого фактора.",
	"invalid-oauth-provider": "EmailAuthProvider не підтримується для цієї операції. Ця операція підтримує лише постачальників OAuth.",
	"invalid-oauth-client-id": "Наданий ідентифікатор клієнта OAuth або недійсний, або не відповідає зазначеному ключу API.",
	"unauthorized-domain": "Цей домен не є авторизованим для операцій OAuth для вашого проекту Firebase. Відредагуйте список авторизованих доменів у консолі Firebase.",
	"invalid-action-code": "проект. Відредагуйте список авторизованих доменів у консолі Firebase.",
	"wrong-password": "Пароль недійсний або користувач не має пароля.",
	"invalid-persistence-type": "Вказаний тип збереження є неприпустимим. Він може бути лише локальним, сеансовим або ніяким.",
	"invalid-phone-number": "Формат наданого телефонного номера неправильний. Введіть номер телефону у форматі, який можна перетворити на формат E.164. Телефонні номери E.164 записуються у форматі [+][код країни][номер абонента, включаючи код міста].",
	"invalid-provider-id": "Вказаний ідентифікатор постачальника недійсний.",
	"invalid-recipient-email": "Не вдалося надіслати електронного листа, який відповідає цій дії, оскільки вказана адреса електронної пошти одержувача недійсна.",
	"invalid-sender": "Шаблон електронної пошти, що відповідає цій дії, містить неприпустиму адресу електронної пошти або ім'я відправника. Будь ласка, виправте, перейшовши до розділу шаблонів електронної пошти Auth у консолі Firebase.",
	"invalid-verification-id": "Ідентифікатор підтвердження, використаний для створення облікових даних для автентифікації телефону, недійсний.",
	"invalid-tenant-id": "Ідентифікатор орендаря екземпляра Auth недійсний.",
	"multi-factor-info-not-found": "У користувача немає другого фактора, що відповідає наданому ідентифікатору.",
	"multi-factor-auth-required": "Для завершення входу потрібне підтвердження володіння другим фактором.",
	"missing-android-pkg-name": "Ім'я пакета Android має бути вказано, якщо потрібно встановити програму Android.",
	"auth-domain-config-required": "Обов'язково увімкніть authDomain під час виклику firebase.initializeApp(), дотримуючись інструкцій у консолі Firebase.",
	"missing-app-credential": "У запиті на перевірку телефону немає затвердження верифікатора програми. Необхідно надати токен відповіді reCAPTCHA.",
	"missing-verification-code": "Облікові дані для автентифікації телефону були створені з порожнім кодом підтвердження SMS.",
	"missing-continue-uri": "URL-адреса продовження повинна бути вказана у запиті.",
	"missing-iframe-start": "Відбулася внутрішня помилка.",
	"missing-ios-bundle-id": "Ідентифікатор пакета iOS повинен бути наданий, якщо наданий ідентифікатор магазину додатків.",
	"missing-multi-factor-info": "Ідентифікатор другого фактора не надається.",
	"missing-multi-factor-session": "У запиті відсутнє підтвердження першого фактора успішного входу.",
	"missing-or-invalid-nonce": "Запит не містить допустимого одноразового номера. Це може статися, якщо хеш SHA-256 наданого необробленого одноразового номера не відповідає хешованому одноразовому номеру в корисному навантаженні токена ідентифікатора.",
	"missing-phone-number": "Для надсилання кодів підтвердження вкажіть номер телефону одержувача.",
	"missing-verification-id": "Облікові дані для автентифікації телефону були створені з порожнім ідентифікатором перевірки.",
	"app-deleted": "Цей екземпляр FirebaseApp було видалено.",
	"account-exists-with-different-credential": "Обліковий запис вже існує з тією ж адресою електронної пошти, але іншими обліковими даними для входу. Увійдіть за допомогою провайдера, пов'язаного з цією адресою електронної пошти.",
	"network-request-failed": "Відбулася мережна помилка (наприклад, тайм-аут, перерване з'єднання або недоступний хост).",
	"no-auth-event": "Відбулася внутрішня помилка.",
	"no-such-provider": "Користувач не був прив'язаний до облікового запису цього провайдера.",
	"null-user": "Нульовий об'єкт користувача був наданий як аргумент для операції, для якої потрібно ненульовий об'єкт користувача..",
	"operation-not-allowed": "Вказаний постачальник послуг входу вимкнено для цього проекту Firebase. Увімкніть його в консолі Firebase на вкладці «Метод входу» в розділі «Автентифікація».",
	"operation-not-supported-in-this-environment": "Ця операція не підтримується в середовищі, в якому працює ця програма. «location.protocol» повинен бути http, https або chrome-extension, а веб-сховище має бути включене .",
	"popup-blocked": "Не вдалося встановити з'єднання зі спливаючою вікном. Можливо, він був заблокований браузером.",
	"popup-closed-by-user": "Спливне вікно було закрито користувачем до завершення операції.",
	"provider-already-linked": "Користувач може бути пов'язаний лише з одним ідентифікатором для цього провайдера.",
	"quota-exceeded": "Перевищено квоту проекту на цю операцію.",
	"redirect-cancelled-by-user": "Операцію перенаправлення було скасовано користувачем до завершення.",
	"redirect-operation-pending": "Операція перенаправлення входу вже чекає на виконання.",
	"rejected-credential": "Запит містить неправильні або невідповідні облікові дані.",
	"second-factor-already-in-use": "Другий фактор вже зарахований з цього приводу.",
	"maximum-second-factor-count-exceeded": "Перевищено максимально допустиму кількість секундних факторів для користувача.",
	"tenant-id-mismatch": "Наданий ідентифікатор клієнта не відповідає ідентифікатору клієнта екземпляра Auth.",
	"timeout": "Час операції закінчився.",
	"user-token-expired": "Облікові дані користувача більше не дійсні. Користувач повинен знову увійти до системи.",
	"too-many-requests": "Ми заблокували всі запити з цього пристрою через незвичайну активність. Спробуйте пізніше.",
	"unauthorized-continue-uri": "Домен URL-адреси продовження не внесений до білого списку. Додайте домен до білого списку в консолі Firebase.",
	"unsupported-first-factor": "Для реєстрації другого фактора або входу за допомогою багатофакторного облікового запису потрібен вхід з підтримуваним першим фактором.",
	"unsupported-persistence-type": "Поточне середовище не підтримує зазначений тип збереження.",
	"unsupported-tenant-operation": "Ця операція не підтримується в розрахованому на багато користувачів контексті.",
	"unverified-email": "Для операції потрібна підтверджена адреса електронної пошти.",
	"user-cancelled": "Користувач не надав вашій програмі запитаних дозволів.",
	"user-not-found": "Немає запису користувача, який відповідає цьому ідентифікатору. Можливо, користувач був видалений.",
	"user-disabled": "Обліковий запис користувача вимкнено адміністратором.",
	"user-mismatch": "Надані облікові дані не відповідають користувачеві, що раніше увійшов до системи.",
	"user-signed-out": "",
	"weak-password": "Пароль повинен складатися з шести або більше символів.",
	"web-storage-unsupported": "Цей браузер не підтримується, або сторонні файли cookie та дані можуть бути вимкнені."
}
